tests/jmeter/gui_html_report/statistics.json
{
  "[TC-API-01] Auth - Bad Password (401)" : {
    "transaction" : "[TC-API-01] Auth - Bad Password (401)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 316.04,
    "medianResTime" : 318.0,
    "minResTime" : 215.0,
    "maxResTime" : 456.0,
    "pct1ResTime" : 436.59999999999997,
    "pct2ResTime" : 446.79999999999995,
    "pct3ResTime" : 456.0,
    "throughput" : 36.630036630036635,
    "receivedKBytesPerSec" : 8.155906593406593,
    "sentKBytesPerSec" : 8.406307234432234
  },
  "[TC-API-04] Ticket - Fetch My Tickets (200)" : {
    "transaction" : "[TC-API-04] Ticket - Fetch My Tickets (200)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.380000000000003,
    "medianResTime" : 13.0,
    "minResTime" : 7.0,
    "maxResTime" : 67.0,
    "pct1ResTime" : 52.49999999999999,
    "pct2ResTime" : 59.449999999999996,
    "pct3ResTime" : 67.0,
    "throughput" : 48.92367906066536,
    "receivedKBytesPerSec" : 1298.0168710249511,
    "sentKBytesPerSec" : 23.267413772015654
  },
  "[TC-API-03] Ticket - Create Ticket (200/201)" : {
    "transaction" : "[TC-API-03] Ticket - Create Ticket (200/201)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 73.10000000000001,
    "medianResTime" : 48.5,
    "minResTime" : 15.0,
    "maxResTime" : 225.0,
    "pct1ResTime" : 162.0,
    "pct2ResTime" : 176.45,
    "pct3ResTime" : 225.0,
    "throughput" : 43.821209465381244,
    "receivedKBytesPerSec" : 10.227801818580193,
    "sentKBytesPerSec" : 24.99178352322524
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 190.02499999999998,
    "medianResTime" : 217.5,
    "minResTime" : 7.0,
    "maxResTime" : 503.0,
    "pct1ResTime" : 386.8,
    "pct2ResTime" : 444.6499999999999,
    "pct3ResTime" : 492.7700000000002,
    "throughput" : 120.62726176115802,
    "receivedKBytesPerSec" : 829.2894535962002,
    "sentKBytesPerSec" : 45.11742310012063
  },
  "[TC-API-02] Auth - Valid Login (200)" : {
    "transaction" : "[TC-API-02] Auth - Valid Login (200)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 347.5799999999999,
    "medianResTime" : 348.5,
    "minResTime" : 237.0,
    "maxResTime" : 503.0,
    "pct1ResTime" : 453.2,
    "pct2ResTime" : 480.3499999999999,
    "pct3ResTime" : 503.0,
    "throughput" : 37.00962250185049,
    "receivedKBytesPerSec" : 18.9385177646188,
    "sentKBytesPerSec" : 8.16813934122872
  }
}